DataProcessors/ТестированиеКаналаСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ТестированиеКаналаСвязи</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТестированиеКаналаСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТестированиеКаналаСвязи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РезультатыТестированияКаналаСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РезультатыТестированияКаналаСвязи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТестированиеКаналаСвязи/Forms/Форма/Ext/Form/Module.bsl
//++ №15469 2023-03-24
&НаКлиенте
перем ВремяСервернойЧасти;
&НаКлиенте
перем ВремяКлиентскойЧасти;


&НаСервере
Функция ТекущийПользовательСуппорт() 
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Имя = "Support" Тогда
	  Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции 

&НаКлиенте
Процедура ТестовыеЗаписиНажатие(Элемент)
	ОткрытьФорму("РегистрСведений.ТестированиеКаналаСвязи.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура РезультатыТестированияКаналаСвязиНажатие(Элемент)
	ОткрытьФорму("РегистрСведений.РезультатыТестированияКаналаСвязи.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьТест(Команда)
	РезультатДиагностики = "";
	ГСЧ = Новый ГенераторСлучайныхЧисел();
  	Строка = "";
	для Код = 1 По 329 Цикл
	    Строка = Строка + Символ(ГСЧ.СлучайноеЧисло(32, 255));
	КонецЦикла;
	для Код = 1 По 11 Цикл
	    Строка = Строка + Строка;
	КонецЦикла;
	ТД = Новый ТекстовыйДокумент();
	для Код = 1 По РазмерТестовогоФайлаВМб Цикл
	    ТД.ДобавитьСтроку(Строка);
	КонецЦикла;
	ПутьКФайлу = КаталогВременныхФайлов()+"ТестКаналаСвязи.txt"; 
	ТД.Записать(ПутьКФайлу);
	ОбщееВремя = 0;
	ОбщееВремяКлиент = 0;
	ОбщееВремяСервер = 0;
	НомерОтправки = 0;
	ФайлОбработан = Истина;
	
	ОчиститьРегистр();
	
	РезультатДиагностики = "Тестирование канала связи файлом размером " + РазмерТестовогоФайлаВМб + "мб.  Количество перемещений: " + КоличествоТестовыхФайлов + Символы.ПС + Символы.ПС;
	
	ПодключитьОбработчикОжидания("ОтправкаФайлаСКонтролем", 1, Ложь); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаФайлаСКонтролем()
	Если НомерОтправки < КоличествоТестовыхФайлов И ФайлОбработан Тогда
		ФайлОбработан = Ложь;
		НомерОтправки = НомерОтправки + 1;
		ВремяНачалаПередачиФайла = ТекущаяУниверсальнаяДатаВМиллисекундах();
		РезультатДиагностики = РезультатДиагностики + "Отправка файла №" + Формат(НомерОтправки,"ЧГ=0") + "." + Символы.ПС + (Дата(1,1,1) + ВремяНачалаПередачиФайла/1000) + Прав(Формат((ВремяНачалаПередачиФайла/1000 - Цел(ВремяНачалаПередачиФайла/1000)),"ЧДЦ=3; ЧГ=0"), 4) + " - начало передачи (клиентская часть)" + Символы.ПС;
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПомещенияФайлаВоВременноеХранилище", ЭтотОбъект),, ПутьКФайлу, Ложь, УникальныйИдентификатор);
	КонецЕсли;
	Если НомерОтправки = КоличествоТестовыхФайлов И ФайлОбработан Тогда
		ОтключитьОбработчикОжидания("ОтправкаФайлаСКонтролем"); 	
		РезультатДиагностики = РезультатДиагностики + "Среднее время клиентской части:" + Формат(ОбщееВремяКлиент/КоличествоТестовыхФайлов/1000,"ЧДЦ=3; ЧГ=0") + " секунд" + Символы.ПС;
		РезультатДиагностики = РезультатДиагностики + " Среднее время серверной части:" + Формат(ОбщееВремяСервер/КоличествоТестовыхФайлов/1000,"ЧДЦ=3; ЧГ=0") + " секунд" + Символы.ПС;	
		РезультатДиагностики = РезультатДиагностики + "     Среднее время перемещения:" + Формат(ОбщееВремя/КоличествоТестовыхФайлов/1000,"ЧДЦ=3; ЧГ=0") + " секунд" + Символы.ПС;
		ЗаписатьВРегистр(РезультатДиагностики);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОчиститьРегистр()
    Набор = РегистрыСведений.ТестированиеКаналаСвязи.СоздатьНаборЗаписей();
	Набор.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФайлВРегистр(АдресВХранилище)
	РезультатДиагностики = РезультатДиагностики + (Дата(1,1,1) + (ТекущаяУниверсальнаяДатаВМиллисекундах()-1)/1000) + Прав(Формат(((ТекущаяУниверсальнаяДатаВМиллисекундах()-1)/1000 - Цел(ТекущаяУниверсальнаяДатаВМиллисекундах()/1000)),"ЧДЦ=3; ЧН=0; ЧГ=0"), 4) + " - начало чтения из хранилища (серверная часть)"  + Символы.ПС;
	ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла();
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
	РезультатДиагностики = РезультатДиагностики + (Дата(1,1,1) + ТекущаяУниверсальнаяДатаВМиллисекундах()/1000) + Прав(Формат((ТекущаяУниверсальнаяДатаВМиллисекундах()/1000 - Цел(ТекущаяУниверсальнаяДатаВМиллисекундах()/1000)),"ЧДЦ=3; ЧН=0; ЧГ=0"), 4) + " - получено из хранилища (серверная часть)"  + Символы.ПС;
	Менеджер = РегистрыСведений.ТестированиеКаналаСвязи;
	МенеджерЗаписи = Менеджер.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период           = ТекущаяДата();
	МенеджерЗаписи.Дата             = ТекущаяДата();
	МенеджерЗаписи.Файл             = ДвоичныеДанныеФайла;
	МенеджерЗаписи.РазмерФайла      = Строка(ДвоичныеДанныеФайла.Размер()) + " байт";
    МенеджерЗаписи.Записать();
	РезультатДиагностики = РезультатДиагностики + (Дата(1,1,1) + ТекущаяУниверсальнаяДатаВМиллисекундах()/1000) + Прав(Формат((ТекущаяУниверсальнаяДатаВМиллисекундах()/1000 - Цел(ТекущаяУниверсальнаяДатаВМиллисекундах()/1000)),"ЧДЦ=3; ЧН=0; ЧГ=0"), 4 )+ " - записано в регистр (серверная часть)" + Символы.ПС + Символы.ПС;
	ВремяКонцаПередачиФайла = ТекущаяУниверсальнаяДатаВМиллисекундах();;
КонецПроцедуры


&НаСервере
Процедура ЗаписатьВРегистр(РезультатДиагностики)
	Менеджер = РегистрыСведений.РезультатыТестированияКаналаСвязи;
	МенеджерЗаписи = Менеджер.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период           = ТекущаяДата();
	МенеджерЗаписи.Дата             = ТекущаяДата();
	МенеджерЗаписи.Результат        = РезультатДиагностики;
    МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайлаВоВременноеХранилище(Успешно, АдресВХранилище, ВыбранноеИмяФайла, ДопПараметры) Экспорт
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;
	ВремяПередачиФайлаКлиентСервер = ТекущаяУниверсальнаяДатаВМиллисекундах()-1;
	РезультатДиагностики = РезультатДиагностики + (Дата(1,1,1) + ВремяПередачиФайлаКлиентСервер/1000) + Прав(Формат((ВремяПередачиФайлаКлиентСервер/1000 - Цел(ВремяПередачиФайлаКлиентСервер/1000)),"ЧДЦ=3; ЧГ=0"), 4) +  " - помещено в хранилище (клиентская часть)"  + Символы.ПС;
	ВремяКлиентскойЧасти = ВремяПередачиФайлаКлиентСервер-ВремяНачалаПередачиФайла;
	РезультатДиагностики = РезультатДиагностики + "                 " + Формат(ВремяКлиентскойЧасти/1000,"ЧДЦ=3; ЧН=0; ЧГ=0") + " - затраченное время клиентской части (сек.)" + Символы.ПС;
	
	ЗаписатьФайлВРегистр(АдресВХранилище);
	
	// Итог по файлу	
	ВремяСервернойЧасти = ВремяКонцаПередачиФайла-ВремяПередачиФайлаКлиентСервер;
	РезультатДиагностики = РезультатДиагностики + "                 " + Формат(ВремяСервернойЧасти/1000,"ЧДЦ=3; ЧН=0; ЧГ=0") + " - затраченное время серверной части (сек.)" + Символы.ПС;
	РезультатДиагностики = РезультатДиагностики + "                 " + Формат((ВремяКонцаПередачиФайла-ВремяНачалаПередачиФайла)/1000,"ЧДЦ=3; ЧН=0; ЧГ=0") + " - общее затраченное время (сек.)" + Символы.ПС + Символы.ПС;
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.РезультатДиагностики);
	ОбщееВремяКлиент = ОбщееВремяКлиент+ВремяКлиентскойЧасти;
	ОбщееВремяСервер = ОбщееВремяСервер+ВремяСервернойЧасти;
	ОбщееВремя = ОбщееВремя + (ВремяКонцаПередачиФайла-ВремяНачалаПередачиФайла);
	ФайлОбработан = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоТестовыхФайлов = 100;
	РазмерТестовогоФайлаВМб = 5;
	
	Если ТекущийПользовательСуппорт() Тогда
		Элементы.РазмерТестовогоФайлаВМб.ТолькоПросмотр = Ложь;	
	КонецЕсли;	
КонецПроцедуры

//-- №15469 2023-03-24
